CSI API ETABS v1
cAreaObj.GetAllAreas Method
 Retrieves select data for all area objects in the model
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetAllAreas(
	ref int NumberNames,
	ref string[] MyName,
	ref eAreaDesignOrientation[] DesignOrientation,
	ref int NumberBoundaryPts,
	ref int[] PointDelimiter,
	ref string[] PointNames,
	ref double[] PointX,
	ref double[] PointY,
	ref double[] PointZ
)
Function GetAllAreas (
	ByRef NumberNames As Integer,
	ByRef MyName As String(),
	ByRef DesignOrientation As eAreaDesignOrientation(),
	ByRef NumberBoundaryPts As Integer,
	ByRef PointDelimiter As Integer(),
	ByRef PointNames As String(),
	ByRef PointX As Double(),
	ByRef PointY As Double(),
	ByRef PointZ As Double()
) As Integer
Dim instance As cAreaObj
Dim NumberNames As Integer
Dim MyName As String()
Dim DesignOrientation As eAreaDesignOrientation()
Dim NumberBoundaryPts As Integer
Dim PointDelimiter As Integer()
Dim PointNames As String()
Dim PointX As Double()
Dim PointY As Double()
Dim PointZ As Double()
Dim returnValue As Integer
returnValue = instance.GetAllAreas(NumberNames,
	MyName, DesignOrientation, NumberBoundaryPts,
	PointDelimiter, PointNames, PointX,
	PointY, PointZ)
int GetAllAreas(
	int% NumberNames,
	array<String^>^% MyName,
	array<eAreaDesignOrientation>^% DesignOrientation,
	int% NumberBoundaryPts,
	array<int>^% PointDelimiter,
	array<String^>^% PointNames,
	array<double>^% PointX,
	array<double>^% PointY,
	array<double>^% PointZ
)
abstract GetAllAreas :
        NumberNames : int byref *
        MyName : string[] byref *
        DesignOrientation : eAreaDesignOrientation[] byref *
        NumberBoundaryPts : int byref *
        PointDelimiter : int[] byref *
        PointNames : string[] byref *
        PointX : float[] byref *
        PointY : float[] byref *
        PointZ : float[] byref -> int
Parameters
NumberNames
Type: System.Int32
MyName
Type: System.String[]
DesignOrientation
Type: ETABSv1.eAreaDesignOrientation[]
NumberBoundaryPts
Type: System.Int32
PointDelimiter
Type: System.Int32[]
PointNames
Type: System.String[]
PointX
Type: System.Double[]
PointY
Type: System.Double[]
PointZ
Type: System.Double[]
Return Value
Type: Int32
Remarks
See Also
Reference
cAreaObj Interface
ETABSv1 Namespace